In [163]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
csv_path = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(csv_path)

In [164]:
# count no. of unique values in SN column

Users = purchase_data_df.SN.nunique()
  
print("Number of unique players:",
      Users)

#Creating a new DataFrame 
total_players_df = pd.DataFrame({"Total Players": Users},
                               index=[0])
#delete index
total_players_df.index.name = None
total_players_df.head()

Number of unique players: 576

   Total Players
0            576

In [165]:
#attempt to fix Item ID syntax by renaming the column
purchase_data_renamed_df = purchase_data_df.rename(columns={"Item ID": "Item_Id",
                                                            "Purchase ID": "Purchase_Id"
                                                })
purchase_data_renamed_df

,Purchase_Id,SN,Age,Gender,Item_Id,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [166]:
#running to see if it will work with new column name
unique_items = purchase_data_renamed_df.Item_Id.nunique()

print("Number of unique item ids:",
      unique_items)
unique_items_df = pd.DataFrame({"Number of Unique Items": unique_items}, 
                               index=[0])
unique_items_df

Number of unique item ids: 179

   Number of Unique Items
0                     179

In [167]:
#leaving this here as a reference for fact checking
purchase_data_df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   91.755128    3.050987
std     225.310896    6.659444   52.697702    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   47.750000    1.980000
50%     389.500000   22.000000   92.000000    3.150000
75%     584.250000   25.000000  138.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [168]:
#average price
average_price = (purchase_data_renamed_df["Price"].mean())
print(average_price)

3.050987179487176

In [169]:
#total purchases
purchase_id = purchase_data_renamed_df.Purchase_Id.count()
print(purchase_id)

780

In [170]:
#Total Revenue
total_revenue = purchase_data_renamed_df.Price.sum()
print(total_revenue)

2379.77

In [171]:
#New Summary Table
summary_df = pd.DataFrame({"Number of Unique Items": unique_items,
                                      "Average Price": average_price,
                                      "Number of Purchases": purchase_id,
                                      "Total Revenue": total_revenue}, index=[0])
summary_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [172]:
#now format the average price and total revenue to show as dollars# First convert "average_donation", "goal", and "pledged" columns to float
# Then Format to go to two decimal places, include a dollar sign, and use comma notation
summary_df["Average Price"] = summary_df["Average Price"].astype(float).map("${:,.2f}".format)
summary_df["Total Revenue"] = summary_df["Total Revenue"].astype(float).map("${:,.2f}".format)
#hosted_in_us_df["pledged"] = hosted_in_us_df["pledged"].astype(float).map("${:,.2f}".format)
summary_df.head()

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [173]:
#group by gender
#gender_summary = purchase_data_renamed_df.groupby("Gender")

In [174]:
#count total gender input
gender_total = gender_summary.nunique()["SN"]
gender_total

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [175]:
# Total count by gender and divivde by total players 
percentage_of_players = gender_total / Users * 100

In [178]:
# Create a new column that finds the percent
gender_summary_df = pd.DataFrame({"Total Count" : gender_total,
                                  "Percentage of Players" : percentage_of_players})

In [179]:
#delete index
#gender_summary_df.index.name = None
gender_summary_df

                       Total Count  Percentage of Players
Female                          81              14.062500
Male                           484              84.027778
Other / Non-Disclosed           11               1.909722

In [180]:
#format percentages
gender_summary_df.style.format({"Percentage of Players":"{:.2f}%"})

In [197]:
#Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender
#group by gender
gender_summary = purchase_data_renamed_df.groupby("Gender")
#count total gender input
gender_total = gender_summary.nunique()["SN"]
gender_total
#total purchases
total_purchase_gender = purchase_data_renamed_df.groupby("Gender")["Purchase_Id"].count()
print(total_purchase_gender)
#avg purchase price
average_price_gender = purchase_data_renamed_df.groupby("Gender")["Price"].mean()
print(average_price_gender)
#avg purchase total per person
avg_purchase_total_gender = gender_summary["Price"].sum()
print(avg_purchase_total_gender)
#Create a summary data frame to hold the results

#Optional: give the displayed data cleaner formatting

#Display the summary data frame

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase_Id, dtype: int64
Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64
Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64